def welcome_message_on_start():
    return """سلام! ✋ به دنگ‌ یار خوش اومدی! 💸  
      
من اینجام تا دیگه هیچ‌وقت سر حساب و کتاب دورهمی‌ها، سفرها و کافه‌ها به مشکل نخورید.  
      
می‌تونی منو به گروهت اضافه کنی تا حواسم به دنگِ همه باشه، یا همینجا یه صورت‌حساب جدید بسازی و لینکش رو برای دوستات بفرستی."""

def welcome_menu_on_start():
    return "از منوی زیر مشخص کن چیکار کنیم: 👇"

def welcome_message_on_group_new_dong(group_name):
    return f"""
    سلام! ✋ به دنگ‌ یار خوش اومدی! 💸 
    
    من اینجام تا دیگه هیچ‌وقت سر حساب و کتاب دورهمی‌ها، سفرها و کافه‌ها به مشکل نخورید.
    
    شما در حال ساخت دنگ جدید در گروه {group_name} هستید.
    
"""


def heard_dong():
    return """شنیدم یکی گفت «دنگ»! 👀👂
    گوشام تیز شد! کسی خرجی کرده؟ اگه می‌خواید حساب و کتاب کنید و دنگ‌ها رو جمع کنید، کار رو بسپارید به من!
    کافیه مادرخرج روی دکمه زیر کلیک کنه تا پرونده این دورهمی رو باز کنیم و بیفتیم به جون بدهکارا! 💸😎
        """


def dong_creation_main_prompt(dong_name="-", amount="-", participants="-", info="-", step=0, prompt=" "):
    # Check if participants is a list, and transform it into a clean layout
    if isinstance(participants, list):
        # This joins each name with a new line and a bullet point emoji
        participants_text = "\n".join([f"  🔸 {p}" for p in participants])
    else:
        participants_text = participants

    return f"""💸 ساخت دنگ جدید

━━━━━━━━━━━━━━━━

📍 عنوان خرج
{dong_name} 

💰 مبلغ کل
{amount}

👥 افراد شریک
{participants_text}

📝 توضیحات
{info}

━━━━━━━━━━━━━━━━
{"⬜️" * (5 - step)}{"✅" * step}


{prompt}


    """


def stage_name_prompt():
    name_prompt = """بزن بریم یه دنگ جدید درست کنیم 💸
اول بگو برای چی بوده؟ اسم مکان، کافه، رستوران یا هر توضیحی که دوست داری بنویس.
مثلاً: کافه رُز، شام، سفر شمال
    """
    return name_prompt


def stage_amount_prompt():
    return """مبلغ کل این خرج چقدر بوده؟ 💰
لطفاً فقط عدد رو و به تومان وارد کن .
مثلاً: 850000
    """


def stage_participants_prompt():
    return """چه کسانی توی این دنگ شریکن؟ 👥
اسم‌ها رو بفرست یا از بین اعضا انتخاب کن.
    """


def stage_additional_info_prompt():
    return """اگر لازم می‌دونی شماره کارت، توضیح یا جزئیات بیشتر رو وارد کن 📝
مثلاً:
6037-xxxx-xxxx-xxxx
یا: سهم‌ها بعداً تسویه میشه
    """


def stage_confirm_prompt():
    return """لطفاً اطلاعات واردشده را بررسی کن.
در صورت تأیید، دنگ در گروه ارسال خواهد شد ✅
"""



def guide_message():
    return """اینجا بهت یاد میدم چطوری حساب‌کتاب‌های گروه رو مثل آب خوردن مدیریت کنی:
*قدم اول: منو ببر تو گروهت! 🚀*
کافیه بری تو پروفایل من (همین ربات)، دکمه “Add to Group” یا “افزودن به گروه” رو بزنی و گروه مورد نظرت رو انتخاب کنی.
(اگر نبود برو توی گروهتون و اونجا من رو اضافه کن(یادت نره start من رو زده باشی)


*قدم دوم: چرا بهتره ادمین باشم؟💻 *
برای اینکه بتونم پیام‌ها رو بخونم، وقتی کسی گفت «دنگ» سریع پیدام بشه، فیش‌های واریزی رو بررسی کنم و لیست بدهکارها رو پیام‌سنجاق (Pin) کنم، حتماً منو تو گروهت ادمین کن. (نگران نباش، من کاری به چت‌های شخصیتون ندارم، فقط دنبال پولم! 🥸)

*قدم سوم: کلمه جادوییِ «دنگ» 🪄*
هر وقت تو گروه خرجی کردید، کافیه یک نفر تو چت بنویسه: دنگ
من همون لحظه ظاهر میشم!

*قدم چهارم: مادرخرج وارد می‌شود! 😎*
وقتی من پیدام شد، کسی که پول رو حساب کرده (مادرخرج) روی دکمه‌ای که می‌فرستم کلیک می‌کنه. اونجا ازش می‌پرسم:
شماره کارتت چیه؟ 💳
چند نفر باید پول بدن؟ 👥 و ….

*قدم پنجم: تسویه حساب و فیش واریزی 🧾*
حالا لیست آماده‌ست! هرکسی که سهمش رو کارت‌به‌کارت کرد، کافیه عکس فیش واریزی رو تو گروه ریپلای کنه روی لیست من. من فیش رو تایید می‌کنم، اسمش رو از لیست بدهکارا خط می‌زنم و می‌گم چقدر از پول جمع شده و کیا هنوز پیچوندن!

💡 نکته مهم: مادرخرج می‌تونه هر زمان که خواست با زدن یک دکمه، به بدهکارا پیام هشدار بفرسته تا زودتر پول رو بزنن!
بزن بریم که هیچ پولی نباید رو زمین بمونه! 💸💪💻
    """




def github_info_message() :
    return """این پروژه کاملا Open Source منتشر شده.💻

شما میتونید کدها رو ببینید، فورک کنید، تغییر بدید و واسه خودتون شخصی‌سازی کنید.

اگه باگی دیدید، پیشنهادی داشتید یا خواستید فیچر جدیدی اضافه کنید، حتما تو گیت‌هاب Issue بزنید یا PR (Pull Request) بدید تا با هم بررسیش کنیم. 🛠

🔗 لینک ریپازیتوری گیت هاب بات:
https://github.com/IliyaEsmaeili/DONG-YAR-BOT

⭐️ اگه با بات حال کردید یا کدها به دردتون خورد، با یه Star دادن به ریپو خستگی یه نرد رو در میکنید! 🤓"""


def telegram_info_message():
    return """این ربات همزمان توی تلگرام هم با قدرت فعال و در دسترسه! 🚀

اگه اونجا راحت‌تری، میتونی از طریق آیدی زیر پیداش کنی و دنگ‌هات رو اونجا مدیریت کنی:

🆔 @dong_yaar_bot"""
def bale_info_message():
    return """این ربات همزمان توی بله هم با قدرت فعال و در دسترسه! 🚀

اگه اونجا راحت‌تری، میتونی از طریق آیدی زیر پیداش کنی و دنگ‌هات رو اونجا مدیریت کنی:

🆔 @dong_yar_bot"""


def developer_info_message():
    return """سازنده‌ش منم! :) 🙋‍♂️️️️️️️️️️️️

ایلیا اسماعیلی هستم، دانشجوی مهندسی کامپیوتر(SBU) 🎓.

 یه نردِ عاشق هوش مصنوعی، برنامه‌نویسی و توسعه بک‌اند.

 تو استک‌های مختلفی مثل پایتون، ++C، جاوا، فلاتر و... هم دست به کدم و کلا از تبدیل کردن ایده‌ها به واقعیت لذت میبرم. ✨

اطلاعات بیشتر در گیتهاب من  : 
https://github.com/IliyaEsmaeili

اگه پروژه‌ای داشتی یا خواستی همکاری کنیم، با کمال میل هستم! 🚀
راه‌های ارتباطی با من:
📧 ایمیل کاری: iliya.esmaeili.u@gmail.com
📧 ایمیل دانشگاهی (ملی): i.esmaeili@mail.sbu.ac.ir
💼 لینکدین: iliya-esmaeili"""

def bot_info_message():
   return """ایده ساخت این بات از یه درد مشترک و عمیق سرچشمه میگیره: دوستایی که هیچ‌وقت دنگ‌هاشون رو نمیزدن..! 🥲💸

 تصمیم گرفتم دست به کد بشم و این بات رو بنویسم تا یه کمکی به «مادر خرج» های عزیز و مظلوم کرده باشم.💳 😂

خلاصه که دوستانِ دنگ‌نده... دوران خوشی و فرار از دنگ به پایان رسید! یوهاهاها!😈(خودتون با لحن شیطانی بخونیدش)

برای دیدن کد بات روی دکمه "گیتهاب 💻" بزنید👇"""


def donate_info_message():
    return """حمایت مالی از این پروژه اصلا و ابدا اجباری نیست! 🙏

ولی اگه بات کارتو راه انداخت، تونستی دنگ‌هاتو زنده کنی و دوست داشتی از من حمایت کنی، میتونی یه قهوه مهمونم کنی. ☕️

این حمایت‌ها مستقیما صرف نگهداری سرور، بهبود کیفیت همین بات و خلق پروژه‌های Open Source خفن‌ترِ بعدی میشه. دم همه‌تون گرم! ❤️

🔗 لینک حمایت مالی (دونیت):
https://reymit.ir/iliya_esmaeili"""